Revit 2024 API
StructDeckEmbeddingType Enumeration
 Used in class CompoundStructure to specify the usage of a layer whose function is StructuralDeck.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum StructDeckEmbeddingType
Visual Basic
Public Enumeration StructDeckEmbeddingType
Visual C++
public enum class StructDeckEmbeddingType
Members
Member name | Description
Invalid |  Invalid usage.
MergeWithLayerAbove |  Bound layer above.
Standalone |  Standalone deck.
See Also
Autodesk.Revit.DB Namespace